DataProcessors/НастройкаПравилОбработкиЗаявокСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>НастройкаПравилОбработкиЗаявокСотрудников</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ИспользуемаяФункциональностьСервисаКабинетСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ИспользуемаяФункциональностьСервисаКабинетСотрудника</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗаявленияНаДСВ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаДСВПроцентом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаДСВСуммой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаДСВПроцентомНеБолееСуммы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СкрытьРазделКомпания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СкрытьРазделСправки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СкрытьРазделДокументы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомпенсацияОтпускаНедоступна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолучениеДокументаСЭПНедоступно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УровеньДоступаКИ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УровниДоступаКИнформацииОСотрудниках</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсполнителиЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ИсполнителиЗадач</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГруппаИсполнителейЗадач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыИсполнителейЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РольИсполнителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновнойОбъектАдресации</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДополнительныйОбъектАдресации</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПравилаОбработкиЗаявокСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПравилаОбработкиЗаявокСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокЗадачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяПодпись</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РольИсполнителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыЗаявокСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ПравилаСогласованияЗаявокКабинетСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ПравилаСогласованияЗаявокКабинетСотрудника</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗаявокКабинетСотрудника</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПравила</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ШагиПравилаСогласования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ШагСогласования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипШага</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыШаговСогласованияКабинетСотрудника</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольПодписанта</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РолиПодписантовКабинетСотрудника</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подписант</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуемаяПодпись</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТребуемойПодписиКабинетСотрудника</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЭтапыЗаявокСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ЭтапыЗаявокСотрудников</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешнийСервис</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:EnumRef.ТипыЗаявокКабинетСотрудника</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТочкаМаршрутаЗаявкиСотрудника</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/НастройкаПравилОбработкиЗаявокСотрудников/Forms/НастройкаПравилОбработкиЗаявокСотрудников/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗавершатьЗаявкиСотрудникаПослеПодписанияСправки = Константы.ЗавершатьЗаявкиСотрудниковПослеПодписанияСправки.Получить();
	ПубликоватьСтруктуруЮридическихЛиц = КабинетСотрудника.ПубликоватьСтруктуруЮридическихЛиц();
	
	ВидНастройки = ВидНастройки();
	СтруктурыПредприятияРезультатПроверки = ПроверитьСтруктуруПредприятия();
	СтруктураПредприятияДоступна = СтруктурыПредприятияРезультатПроверки.Доступна;
	ЗаблокированоНаВремяОбновления = ЗаблокированоНаВремяОбновления();
	Если (ВидНастройки <> 0 И Не СтруктураПредприятияДоступна) Или ЗаблокированоНаВремяОбновления Тогда
		// Используется настройка с точностью до структуры предприятия,
		// но пользователю недоступна структура предприятия.
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"НастройкиПравилСтруктураПредприятия", "Доступность", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ФормаЗаписатьИЗакрыть", "Доступность", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ФормаЗаписать", "Доступность", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ФормаОтчетПоЗадачам", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ВидНастройки", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ДекорацияОграничениеДоступности", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ПоказыватьРасформированные", "Видимость", Ложь);
		Если ЗаблокированоНаВремяОбновления Тогда
			Элементы.ДекорацияНастройкаНедоступна.Заголовок = НСтр("ru = 'Настройка правил недоступна. Дождитесь окончания обновления правил.'");
		КонецЕсли;
	Иначе
		СтруктураПредприятияПустая = СтруктурыПредприятияРезультатПроверки.Пустая;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ДекорацияПустаяСтруктураПредприятия", "Видимость", СтруктураПредприятияПустая);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ГруппаНастройки", "Доступность", Не СтруктураПредприятияПустая);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ФормаЗаписатьИЗакрыть", "Доступность", Не СтруктураПредприятияПустая);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ФормаЗаписать", "Доступность", Не СтруктураПредприятияПустая);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ГруппаНастройкаНедоступна", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ДекорацияОграничениеДоступности", "Видимость", Не СтруктураПредприятияДоступна);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ВидНастройки", "Доступность", СтруктураПредприятияДоступна И Не СтруктураПредприятияПустая);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ПоказыватьРасформированные", "Доступность", СтруктураПредприятияДоступна И Не СтруктураПредприятияПустая);
		Если Не СтруктураПредприятияПустая Тогда
			ЗаполнитьНастройкиМаршрутов();
		КонецЕсли;
	КонецЕсли;
	
	УстановитьВидимостьЭлементов();
	УстановитьУсловноеОФормление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Оповещение = Новый ОписаниеОповещения("ЗаписатьИЗакрытьНаКлиенте", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ИспользуетсяКадровыйЭДОЗаписанаКонстанта" Тогда
		Элементы.НастройкиПравилЭтапыТребуетсяПодпись.Видимость = Параметр;
		Элементы.НастройкиПравилСтруктураПредприятияЭтапыТребуетсяПодпись.Видимость = Параметр;
		Если Параметр Тогда
			Возврат;	
		КонецЕсли;
		ЗавершатьЗаявкиСотрудникаПослеПодписанияСправки = Ложь;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидНастройкиПриИзменении(Элемент)
	Если ВидНастройки = 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ВидНастройкиПриИзмененииЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Настройки в разрезе структурных единиц будут очищены. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		ВидНастройкиПриИзмененииЗавершение(КодВозвратаДиалога.Да, Неопределено);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершатьЗаявкуЭлектронныйДокументПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкиПравил

&НаКлиенте
Процедура НастройкиПравилПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПравилПриАктивизацииСтроки(Элемент)
	Если ВидНастройки = 0 И Элементы.ГруппаНастройки.Доступность Тогда
		ЗаполнитьНастройкиБезСтруктуры(Элементы.НастройкиПравил.ТекущиеДанные.РольИсполнителя);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПравилСписокПользователейНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.НастройкиПравил.ТекущиеДанные;
	СписокПользователейСтроки 	= ТекущиеДанные.СписокПользователей;
	РольИсполнителяСтроки 		= Элементы.НастройкиПравил.ТекущиеДанные.РольИсполнителя;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("СписокПользователей", 	СписокПользователейСтроки.ВыгрузитьЗначения());
	ПараметрыОткрытия.Вставить("РольИсполнителя", 		РольИсполнителяСтроки);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СписокПользователейВыборЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.НастройкаПравилОбработкиЗаявокСотрудников.Форма.ИсполнителиЗаявок", ПараметрыОткрытия, ЭтотОбъект, , , ,
				 ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				 
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПравилВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Вид = ВидПоляФормы.ПолеНадписи И Поле.Гиперссылка Тогда
		
		ТекущаяРоль = Элементы.НастройкиПравил.ТекущиеДанные.РольИсполнителя;
		ТипЗаявки = ВидЗаявкиСЭтапамиВнешнегоСервиса(ТекущаяРоль);
		
		Если ТипЗаявки <> Неопределено Тогда
			ПараметрыОткрытия = Новый Структура("ТипЗаявки", ТипЗаявки); 
			ОткрытьФорму(
				"Справочник.ПравилаСогласованияЗаявокКабинетСотрудника.ФормаСписка",
				ПараметрыОткрытия);
		КонецЕсли;
			
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкиПравилСтруктураПредприятия

&НаКлиенте
Процедура НастройкиПравилСтруктураПредприятияСписокПользователейПриИзменении(Элемент)
	ЗаполнитьПодчиненныеЭлементы("СписокПользователей");	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПравилСтруктураПредприятияСписокПользователейНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.НастройкиПравилСтруктураПредприятия.ТекущиеДанные;
	СписокПользователейСтроки 	= ТекущиеДанные.СписокПользователей;
	ПодразделениеСтроки 		= ТекущиеДанные.Подразделение;
	РольИсполнителяСтроки 		= Элементы.НастройкиПравил.ТекущиеДанные.РольИсполнителя;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("СписокПользователей", 	СписокПользователейСтроки.ВыгрузитьЗначения());
	ПараметрыОткрытия.Вставить("Подразделение", 		ПодразделениеСтроки);
	ПараметрыОткрытия.Вставить("РольИсполнителя", 		РольИсполнителяСтроки);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СписокПользователейВыборЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.НастройкаПравилОбработкиЗаявокСотрудников.Форма.ИсполнителиЗаявок", ПараметрыОткрытия, ЭтотОбъект, , , ,
				 ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПравилСтруктураПредприятияПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкиПравилЭтапы

&НаКлиенте
Процедура НастройкиПравилЭтапыПриИзменении(Элемент)
	Модифицированность = Истина;
	ЗаполнитьИзНастроекБезСтруктуры("Этапы");
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПравилЭтапыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Вид = ВидПоляФормы.ПолеНадписи И Поле.Гиперссылка Тогда	
		Этап = Элементы.НастройкиПравилЭтапы.ТекущиеДанные.Этап;
		ОткрытьФорму(
			"Справочник.ПравилаСогласованияЗаявокКабинетСотрудника.ФормаОбъекта",
			ПараметрыОткрытияПравилаСогласования(Этап));
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкиПравилСтруктураПредприятияЭтапы

&НаКлиенте
Процедура НастройкиПравилСтруктураПредприятияЭтапыПриИзменении(Элемент)
	Модифицированность = Истина;
	ЗаполнитьПодчиненныеЭлементы("Этапы");
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПравилСтруктураПредприятияЭтапыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Вид = ВидПоляФормы.ПолеНадписи И Поле.Гиперссылка Тогда		
		Этап = Элементы.НастройкиПравилСтруктураПредприятияЭтапы.ТекущиеДанные.Этап;
		Подразделение = Элементы.НастройкиПравилСтруктураПредприятия.ТекущиеДанные.Подразделение;
		ОткрытьФорму(
			"Справочник.ПравилаСогласованияЗаявокКабинетСотрудника.ФормаОбъекта",
			ПараметрыОткрытияПравилаСогласования(Этап, Подразделение));
	КонецЕсли;		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьНастройкиПравилОбработки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНастройкиПравилОбработки();	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьСогласованиеКабинетСотрудника(Команда)
	
	ТекущаяРоль = Элементы.НастройкиПравил.ТекущиеДанные.РольИсполнителя;
	ТипЗаявки = ВидЗаявкиСЭтапамиВнешнегоСервиса(ТекущаяРоль);
	
	Если ТипЗаявки <> Неопределено Тогда
		ПараметрыОткрытия = Новый Структура("ТипЗаявки", ТипЗаявки); 
		ОткрытьФорму(
			"Справочник.ПравилаСогласованияЗаявокКабинетСотрудника.ФормаСписка",
			ПараметрыОткрытия);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для данного типа заявки не предусмотрена настройка этапов согласования на стороне 1С:Кабинет сотрудника'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоЗаявкам(Команда)
	ОткрытьФорму("Отчет.Задачи.ФормаОбъекта", ПараметрыОткрытияОтчета());
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьРасформированныеПриИзменении(Элемент)
	НастройкиПравил.Очистить();
	ЗаполнитьНастройкиМаршрутов();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЧтениеПравилОбработки

&НаСервере
Процедура ЗаполнитьНастройкиМаршрутов()
	
	НастройкиПравилВыгрузка = РеквизитФормыВЗначение("НастройкиПравил");
	ИспользуемаяФункциональностьСервиса = РегистрыСведений.ИспользуемаяФункциональностьСервисаКабинетСотрудника.Настройки();
	СписокРолей = БизнесПроцессыЗаявокСотрудников.РолиИсполнителейЗадач();
	Если Не ИспользуемаяФункциональностьСервиса.ЗаявленияНаДСВ Тогда
		РольНаУдаление = СписокРолей.Найти(БизнесПроцессыЗаявокСотрудниковВнутренний.РольИсполнителяОтветственныйЗаУдержаниеДСВ());
		Если РольНаУдаление <> Неопределено Тогда
			СписокРолей.Удалить(РольНаУдаление);
		КонецЕсли;
	КонецЕсли;
	ТаблицаПравилНастроек = ТаблицаПравилНастроек(СписокРолей);
	ТаблицаПользователей = ТаблицаПользователей(СписокРолей);
	
	СтрокиПоРоли = Неопределено;
	Для каждого Роль Из СписокРолей Цикл
		
		НастройкаПравил = НастройкиПравилВыгрузка.Добавить();
		НастройкаПравил.РольИсполнителя = Роль;
		НастройкаПравил.СписокПользователей.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Пользователи");
		Если ВидЗаявкиСЭтапамиВнешнегоСервиса(Роль) <> Неопределено Тогда
			НастройкаПравил.Гиперссылка = НСтр("ru = 'Правила согласования 1С:Кабинет сотрудника'");	
		КонецЕсли;
		
		Колонки = НастройкаПравил.СтруктураПредприятия.Колонки; 
		Колонки.Добавить("Подразделение");
		Колонки.Добавить("Этапы", Новый ОписаниеТипов("ТаблицаЗначений"));
		Колонки.Добавить("СписокПользователей", Новый ОписаниеТипов("СписокЗначений"));
		
		СтрокиПоРоли = ТаблицаПравилНастроек.Строки.НайтиСтроки(Новый Структура("РольИсполнителя", Роль));
		МассивПовторяющихся = Новый Массив;
		Для каждого СтрокаПоРоли Из СтрокиПоРоли Цикл
			Если МассивПовторяющихся.Найти(СтрокаПоРоли.Подразделение) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			МассивПовторяющихся.Добавить(СтрокаПоРоли.Подразделение);
			НоваяСтрокаСтруктураПредприятия = НастройкаПравил.СтруктураПредприятия.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаСтруктураПредприятия, СтрокаПоРоли);
			ЗаполнитьДерево(НоваяСтрокаСтруктураПредприятия, СтрокаПоРоли, МассивПовторяющихся);
		КонецЦикла;
				
		Отбор = Новый Структура("РольИсполнителя", Роль);
		СтрокиПоРоли = ТаблицаПравилНастроек.Строки.НайтиСтроки(Отбор, Истина);
		СтрокиЭтаповПоПодразделению = Новый Соответствие;
		Для Каждого СтрокаПоРоли Из СтрокиПоРоли Цикл
			Если СтрокиЭтаповПоПодразделению[СтрокаПоРоли.Подразделение] = Неопределено Тогда
				СтрокиЭтаповПоПодразделению.Вставить(СтрокаПоРоли.Подразделение, Новый Массив);
			КонецЕсли;
			СтрокиЭтаповПоПодразделению[СтрокаПоРоли.Подразделение].Добавить(СтрокаПоРоли);
		КонецЦикла;
		
		Для каждого ЭлементСтруктурыПредприятия Из ПолучитьЭлементы(НастройкаПравил.СтруктураПредприятия) Цикл
			
			Отбор.Вставить("Подразделение", ЭлементСтруктурыПредприятия.Подразделение);
			
			ЭлементСтруктурыПредприятия.СписокПользователей.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Пользователи");
			ЭлементСтруктурыПредприятия.СписокПользователей.ЗагрузитьЗначения(
				ТаблицаПользователей.Скопировать(Отбор).ВыгрузитьКолонку("Исполнитель"));
				
			ТаблицаЭтапов = НовыйТаблицаЭтапы();
			Для Каждого СтрокаЭтапа Из СтрокиЭтаповПоПодразделению[Отбор.Подразделение] Цикл
				СтрокаТаблицыЭтапов = ТаблицаЭтапов.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицыЭтапов, СтрокаЭтапа);
			КонецЦикла;
			ЭлементСтруктурыПредприятия.Этапы = ТаблицаЭтапов;
			
		КонецЦикла;
			
		Если СтрокиПоРоли.Количество() > 0 Тогда
			
			СтрокаСтруктурыПредприятия = НастройкаПравил.СтруктураПредприятия.Строки[0];
			
			НастройкаПравил.СписокПользователей.ЗагрузитьЗначения(СтрокаСтруктурыПредприятия.СписокПользователей.ВыгрузитьЗначения());
			НастройкаПравил.Этапы = СтрокаСтруктурыПредприятия.Этапы.Скопировать();
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(НастройкиПравилВыгрузка, "НастройкиПравил");
	
КонецПроцедуры

&НаСервере
Функция ТаблицаПравилНастроек(СписокРолей)
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВТЭтапы.РольИсполнителя КАК РольИсполнителя,
	               |	ВТЭтапы.Этап КАК Этап,
				   |	ВТЭтапы.ВнешнийСервис КАК ВнешнийСервис
	               |ПОМЕСТИТЬ ВТЭтапыРоли
	               |ИЗ
	               |	&ВТЭтапы КАК ВТЭтапы";
	
	Запрос.УстановитьПараметр("ВТЭтапы", Справочники.ЭтапыЗаявокСотрудников.ТаблицаАктивныхЭтаповИРолейИсполнителя());
	
	Запрос.Выполнить();
	
	Запрос.УстановитьПараметр("ПоказыватьРасформированные", ПоказыватьРасформированные);
	Запрос.УстановитьПараметр("РолиИсполнителей", СписокРолей);
	
	ПустыеПодразделения = БизнесПроцессыЗаявокСотрудников.ПараметрЗапросаПустыеПодразделения();
	Запрос.УстановитьПараметр("ПустыеПодразделения", ПустыеПодразделения);
	
	Если ПубликоватьСтруктуруЮридическихЛиц Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Организации.Ссылка КАК Организация,
		|	РолиИсполнителей.Ссылка КАК РольИсполнителя,
		|	Организации.Наименование КАК Наименование,
		|	ЭтапыРоли.Этап КАК Этап,
		|	ЭтапыРоли.ВнешнийСервис КАК ВнешнийСервис
		|ПОМЕСТИТЬ ВТОрганизацииРоли
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РолиИсполнителей КАК РолиИсполнителей
		|		ПО (РолиИсполнителей.Ссылка В (&РолиИсполнителей))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЭтапыРоли КАК ЭтапыРоли
		|		ПО (РолиИсполнителей.Ссылка = ЭтапыРоли.РольИсполнителя)
		|ГДЕ
		|	НЕ Организации.ПометкаУдаления
		|	И НЕ Организации.Предопределенный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОрганизацииРоли.РольИсполнителя КАК РольИсполнителя,
		|	ОрганизацииРоли.Организация КАК Организация,
		|	ОрганизацииРоли.Наименование КАК Наименование,
		|	ОрганизацииРоли.Этап КАК Этап,
		|	ВЫБОР
		|		КОГДА ОрганизацииРоли.ВнешнийСервис
		|			ТОГДА ""Правила согласования""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Гиперссылка,
		|	ОрганизацииРоли.ВнешнийСервис КАК ВнешнийСервис,
		|	ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПравилаОбработкиЗаявокСотрудников1.СрокЗадачи, ПравилаОбработкиЗаявокСотрудников.СрокЗадачи), ПравилаОбработкиЗаявокСотрудников2.СрокЗадачи), 7) КАК СрокЗадачи,
		|	ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПравилаОбработкиЗаявокСотрудников1.ТребуетсяПодпись, ПравилаОбработкиЗаявокСотрудников.ТребуетсяПодпись), ПравилаОбработкиЗаявокСотрудников2.ТребуетсяПодпись), ЛОЖЬ) КАК ТребуетсяПодпись,
		|	НЕ ПравилаОбработкиЗаявокСотрудников1.Подразделение ЕСТЬ NULL КАК ЗаполненоПодразделениеПравилОбработки
		|ИЗ
		|	ВТОрганизацииРоли КАК ОрганизацииРоли
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
		|		ПО ОрганизацииРоли.Организация = ИсполнителиЗадач.ОсновнойОбъектАдресации
		|			И ОрганизацииРоли.РольИсполнителя = ИсполнителиЗадач.РольИсполнителя
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПравилаОбработкиЗаявокСотрудников КАК ПравилаОбработкиЗаявокСотрудников
		|		ПО ОрганизацииРоли.РольИсполнителя = ПравилаОбработкиЗаявокСотрудников.РольИсполнителя
		|			И (ПравилаОбработкиЗаявокСотрудников.Подразделение В (&ПустыеПодразделения)
		|				ИЛИ ОрганизацииРоли.Организация = ПравилаОбработкиЗаявокСотрудников.Подразделение)
		|			И ОрганизацииРоли.Этап = ПравилаОбработкиЗаявокСотрудников.Этап
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПравилаОбработкиЗаявокСотрудников КАК ПравилаОбработкиЗаявокСотрудников1
		|		ПО ОрганизацииРоли.РольИсполнителя = ПравилаОбработкиЗаявокСотрудников1.РольИсполнителя
		|			И ОрганизацииРоли.Организация = ПравилаОбработкиЗаявокСотрудников1.Подразделение
		|			И ОрганизацииРоли.Этап = ПравилаОбработкиЗаявокСотрудников1.Этап
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПравилаОбработкиЗаявокСотрудников КАК ПравилаОбработкиЗаявокСотрудников2
		|		ПО (ПравилаОбработкиЗаявокСотрудников2.РольИсполнителя = ЗНАЧЕНИЕ(Справочник.РолиИсполнителей.ПустаяСсылка)
		|				ИЛИ ОрганизацииРоли.РольИсполнителя = ПравилаОбработкиЗаявокСотрудников2.РольИсполнителя)
		|			И (ПравилаОбработкиЗаявокСотрудников2.Подразделение В (&ПустыеПодразделения)
		|				ИЛИ ОрганизацииРоли.Организация = ПравилаОбработкиЗаявокСотрудников2.Подразделение)
		|			И ОрганизацииРоли.Этап = ПравилаОбработкиЗаявокСотрудников2.Этап
		|
		|УПОРЯДОЧИТЬ ПО
		|	РольИсполнителя,
		|	ОрганизацииРоли.Наименование,
		|	ВнешнийСервис УБЫВ,
		|	Этап
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТОрганизацииРоли";
		УстановитьПривилегированныйРежим(Истина);
		НастройкиОрганизаций = Запрос.Выполнить().Выгрузить();
		УстановитьПривилегированныйРежим(Ложь);
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтруктураПредприятия.Ссылка КАК Подразделение,
		|	РолиИсполнителей.Ссылка КАК РольИсполнителя,
		|	СтруктураПредприятия.Владелец КАК Владелец,
		|	ЭтапыРоли.Этап КАК Этап,
		|	ЭтапыРоли.ВнешнийСервис КАК ВнешнийСервис
		|ПОМЕСТИТЬ ВТПодразделенияРоли
		|ИЗ
		|	Справочник.ПодразделенияОрганизаций КАК СтруктураПредприятия
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РолиИсполнителей КАК РолиИсполнителей
		|		ПО (РолиИсполнителей.Ссылка В (&РолиИсполнителей))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЭтапыРоли КАК ЭтапыРоли
		|		ПО (РолиИсполнителей.Ссылка = ЭтапыРоли.РольИсполнителя)
		|ГДЕ
		|	(СтруктураПредприятия.Расформировано = ЛОЖЬ
		|			ИЛИ &ПоказыватьРасформированные)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПодразделенияРоли.РольИсполнителя КАК РольИсполнителя,
		|	ПодразделенияРоли.Владелец КАК Организация,
		|	ПодразделенияРоли.Подразделение КАК Подразделение,
		|	ПодразделенияРоли.Этап КАК Этап,
		|	ВЫБОР
		|		КОГДА ПодразделенияРоли.ВнешнийСервис
		|			ТОГДА ""Правила согласования""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Гиперссылка,
		|	ПодразделенияРоли.ВнешнийСервис КАК ВнешнийСервис,
		|	ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПравилаОбработкиЗаявокСотрудников1.СрокЗадачи, ПравилаОбработкиЗаявокСотрудников.СрокЗадачи), ПравилаОбработкиЗаявокСотрудников2.СрокЗадачи), 7) КАК СрокЗадачи,
		|	ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПравилаОбработкиЗаявокСотрудников1.ТребуетсяПодпись, ПравилаОбработкиЗаявокСотрудников.ТребуетсяПодпись), ПравилаОбработкиЗаявокСотрудников2.ТребуетсяПодпись), ЛОЖЬ) КАК ТребуетсяПодпись,
		|	НЕ ПравилаОбработкиЗаявокСотрудников1.Подразделение ЕСТЬ NULL КАК ЗаполненоПодразделениеПравилОбработки
		|ИЗ
		|	ВТПодразделенияРоли КАК ПодразделенияРоли
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
		|		ПО ПодразделенияРоли.Подразделение = ИсполнителиЗадач.ОсновнойОбъектАдресации
		|			И ПодразделенияРоли.РольИсполнителя = ИсполнителиЗадач.РольИсполнителя
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПравилаОбработкиЗаявокСотрудников КАК ПравилаОбработкиЗаявокСотрудников
		|		ПО ПодразделенияРоли.РольИсполнителя = ПравилаОбработкиЗаявокСотрудников.РольИсполнителя
		|			И (ПравилаОбработкиЗаявокСотрудников.Подразделение В (&ПустыеПодразделения)
		|				ИЛИ ПодразделенияРоли.Подразделение = ПравилаОбработкиЗаявокСотрудников.Подразделение)
		|			И ПодразделенияРоли.Этап = ПравилаОбработкиЗаявокСотрудников.Этап
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПравилаОбработкиЗаявокСотрудников КАК ПравилаОбработкиЗаявокСотрудников1
		|		ПО ПодразделенияРоли.РольИсполнителя = ПравилаОбработкиЗаявокСотрудников1.РольИсполнителя
		|			И ПодразделенияРоли.Подразделение = ПравилаОбработкиЗаявокСотрудников1.Подразделение
		|			И ПодразделенияРоли.Этап = ПравилаОбработкиЗаявокСотрудников1.Этап
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПравилаОбработкиЗаявокСотрудников КАК ПравилаОбработкиЗаявокСотрудников2
		|		ПО (ПравилаОбработкиЗаявокСотрудников2.РольИсполнителя = ЗНАЧЕНИЕ(Справочник.РолиИсполнителей.ПустаяСсылка)
		|				ИЛИ ПодразделенияРоли.РольИсполнителя = ПравилаОбработкиЗаявокСотрудников2.РольИсполнителя)
		|			И (ПравилаОбработкиЗаявокСотрудников2.Подразделение В (&ПустыеПодразделения)
		|				ИЛИ ПодразделенияРоли.Подразделение = ПравилаОбработкиЗаявокСотрудников2.Подразделение)
		|			И ПодразделенияРоли.Этап = ПравилаОбработкиЗаявокСотрудников2.Этап
		|
		|УПОРЯДОЧИТЬ ПО
		|	РольИсполнителя,
		|	ПодразделенияРоли.Подразделение ИЕРАРХИЯ,
		|	ВнешнийСервис УБЫВ,
		|	Этап
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПодразделенияРоли
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТЭтапыРоли";
		УстановитьПривилегированныйРежим(Истина);
		ДеревоПодразделений = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		УстановитьПривилегированныйРежим(Ложь);
		
		ДеревоНастроек = Новый ДеревоЗначений;
		ДеревоНастроек.Колонки.Добавить("РольИсполнителя");
		ДеревоНастроек.Колонки.Добавить("Подразделение");
		ДеревоНастроек.Колонки.Добавить("Этап");
		ДеревоНастроек.Колонки.Добавить("СрокЗадачи", Новый ОписаниеТипов("Число"));
		ДеревоНастроек.Колонки.Добавить("ТребуетсяПодпись", Новый ОписаниеТипов("Булево"));
		ДеревоНастроек.Колонки.Добавить("ЗаполненоПодразделениеПравилОбработки", Новый ОписаниеТипов("Булево"));
		ДеревоНастроек.Колонки.Добавить("ВнешнийСервис", Новый ОписаниеТипов("Булево"));
		ДеревоНастроек.Колонки.Добавить("Гиперссылка", Новый ОписаниеТипов("Строка"));
		
		Отбор = Новый Структура("РольИсполнителя,Организация");
		СтрокиДереваПодразделений = ДеревоПодразделений.Строки;
		МассивПовторяющихся = Новый Массив;
		Для каждого СтрокаТЗ Из НастройкиОрганизаций Цикл
					
			НоваяСтрока = ДеревоНастроек.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
			НоваяСтрока.Подразделение = СтрокаТЗ.Организация;
			
			Если МассивПовторяющихся.Найти(СтрокаТЗ.РольИсполнителя) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			МассивПовторяющихся.Добавить(СтрокаТЗ.РольИсполнителя);
			
			ЗаполнитьЗначенияСвойств(Отбор, СтрокаТЗ);
			НайденныеСтроки = СтрокиДереваПодразделений.НайтиСтроки(Отбор);
			ЗаполнитьСтрокиДереваНастроек(НоваяСтрока, НайденныеСтроки);
			
		КонецЦикла;
		
		Возврат ДеревоНастроек;
		
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтруктураПредприятия.Ссылка КАК Подразделение,
		|	РолиИсполнителей.Ссылка КАК РольИсполнителя,
		|	ЭтапыРоли.Этап КАК Этап,
		|	ЭтапыРоли.ВнешнийСервис КАК ВнешнийСервис
		|ПОМЕСТИТЬ ВТПодразделенияРоли
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РолиИсполнителей КАК РолиИсполнителей
		|		ПО (РолиИсполнителей.Ссылка В (&РолиИсполнителей))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЭтапыРоли КАК ЭтапыРоли
		|		ПО (РолиИсполнителей.Ссылка = ЭтапыРоли.РольИсполнителя)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|		ПО СтруктураПредприятия.Источник = ПодразделенияОрганизаций.Ссылка
		|ГДЕ
		|	(ПодразделенияОрганизаций.Расформировано = ЛОЖЬ
		|			ИЛИ &ПоказыватьРасформированные
		|			ИЛИ ПодразделенияОрганизаций.Ссылка ЕСТЬ NULL)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПодразделенияРоли.РольИсполнителя КАК РольИсполнителя,
		|	ПодразделенияРоли.Подразделение КАК Подразделение,
		|	ПодразделенияРоли.Этап КАК Этап,
		|	ВЫБОР
		|		КОГДА ПодразделенияРоли.ВнешнийСервис
		|			ТОГДА ""Правила согласования""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Гиперссылка,
		|	ПодразделенияРоли.ВнешнийСервис КАК ВнешнийСервис,
		|	ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПравилаОбработкиЗаявокСотрудников1.СрокЗадачи, ПравилаОбработкиЗаявокСотрудников.СрокЗадачи), ПравилаОбработкиЗаявокСотрудников2.СрокЗадачи), 7) КАК СрокЗадачи,
		|	ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПравилаОбработкиЗаявокСотрудников1.ТребуетсяПодпись, ПравилаОбработкиЗаявокСотрудников.ТребуетсяПодпись), ПравилаОбработкиЗаявокСотрудников2.ТребуетсяПодпись), ЛОЖЬ) КАК ТребуетсяПодпись,
		|	НЕ ПравилаОбработкиЗаявокСотрудников1.Подразделение ЕСТЬ NULL КАК ЗаполненоПодразделениеПравилОбработки
		|ИЗ
		|	ВТПодразделенияРоли КАК ПодразделенияРоли
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
		|		ПО ПодразделенияРоли.Подразделение = ИсполнителиЗадач.ОсновнойОбъектАдресации
		|			И ПодразделенияРоли.РольИсполнителя = ИсполнителиЗадач.РольИсполнителя
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПравилаОбработкиЗаявокСотрудников КАК ПравилаОбработкиЗаявокСотрудников
		|		ПО ПодразделенияРоли.РольИсполнителя = ПравилаОбработкиЗаявокСотрудников.РольИсполнителя
		|			И (ПравилаОбработкиЗаявокСотрудников.Подразделение В (&ПустыеПодразделения)
		|				ИЛИ ПодразделенияРоли.Подразделение = ПравилаОбработкиЗаявокСотрудников.Подразделение)
		|			И ПодразделенияРоли.Этап = ПравилаОбработкиЗаявокСотрудников.Этап
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПравилаОбработкиЗаявокСотрудников КАК ПравилаОбработкиЗаявокСотрудников1
		|		ПО ПодразделенияРоли.РольИсполнителя = ПравилаОбработкиЗаявокСотрудников1.РольИсполнителя
		|			И ПодразделенияРоли.Подразделение = ПравилаОбработкиЗаявокСотрудников1.Подразделение
		|			И ПодразделенияРоли.Этап = ПравилаОбработкиЗаявокСотрудников1.Этап
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПравилаОбработкиЗаявокСотрудников КАК ПравилаОбработкиЗаявокСотрудников2
		|		ПО (ПравилаОбработкиЗаявокСотрудников2.РольИсполнителя = ЗНАЧЕНИЕ(Справочник.РолиИсполнителей.ПустаяСсылка)
		|				ИЛИ ПодразделенияРоли.РольИсполнителя = ПравилаОбработкиЗаявокСотрудников2.РольИсполнителя)
		|			И (ПравилаОбработкиЗаявокСотрудников2.Подразделение В (&ПустыеПодразделения)
		|				ИЛИ ПодразделенияРоли.Подразделение = ПравилаОбработкиЗаявокСотрудников2.Подразделение)
		|			И ПодразделенияРоли.Этап = ПравилаОбработкиЗаявокСотрудников2.Этап
		|
		|УПОРЯДОЧИТЬ ПО
		|	РольИсполнителя,
		|	ПодразделенияРоли.Подразделение ИЕРАРХИЯ,
		|	ВнешнийСервис УБЫВ,
		|	Этап
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПодразделенияРоли
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТЭтапыРоли";
		СтруктураПредприятия = Новый(БизнесПроцессыЗаявокСотрудниковВнутренний.ТипСтруктураПредприятия());
		ИмяТаблицы = СтруктураПредприятия.Метаданные().ПолноеИмя();
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Таблица", ИмяТаблицы);
		
		УстановитьПривилегированныйРежим(Истина);
		Возврат Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
	КонецЕсли;
		
КонецФункции

&НаСервере
Процедура ЗаполнитьСтрокиДереваНастроек(СтрокаРодитель, КоллекцияСтрокДерева)

	Для каждого СтрокаДерева Из КоллекцияСтрокДерева Цикл
		НоваяСтрока = СтрокаРодитель.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДерева);
		Если СтрокаДерева.Строки.Количество() > 0 Тогда
			ЗаполнитьСтрокиДереваНастроек(НоваяСтрока, СтрокаДерева.Строки);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ТаблицаПользователей(СписокРолей)
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИсполнителиЗадач.РольИсполнителя КАК РольИсполнителя,
	               |	ИсполнителиЗадач.Исполнитель КАК Исполнитель,
	               |	ИсполнителиЗадач.ОсновнойОбъектАдресации КАК Подразделение
	               |ИЗ
	               |	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
	               |ГДЕ
	               |	ИсполнителиЗадач.РольИсполнителя В (&РолиИсполнителей)";
	
	Запрос.УстановитьПараметр("РолиИсполнителей", СписокРолей);
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьДерево(Приемник, Источник, МассивПовторяющихся = Неопределено)
	
	Если МассивПовторяющихся = Неопределено Тогда
		МассивПовторяющихся = Новый Массив;
	КонецЕсли;
	
	Для каждого ЭлементИсточника Из Источник.Строки Цикл
		Если МассивПовторяющихся.Найти(ЭлементИсточника.Подразделение) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		МассивПовторяющихся.Добавить(ЭлементИсточника.Подразделение);
		ЭлементПриемника = Приемник.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника);
		Если ЭлементИсточника.Строки.Количество() > 0 Тогда
			ЗаполнитьДерево(ЭлементПриемника, ЭлементИсточника, МассивПовторяющихся);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НовыйТаблицаЭтапы()
	
	ТаблицаЭтапы = Новый ТаблицаЗначений;
	
	ТаблицаЭтапы.Колонки.Добавить("Этап");
	ТаблицаЭтапы.Колонки.Добавить("СрокЗадачи");
	ТаблицаЭтапы.Колонки.Добавить("ТребуетсяПодпись");
	ТаблицаЭтапы.Колонки.Добавить("Гиперссылка");
	ТаблицаЭтапы.Колонки.Добавить("ВнешнийСервис");
	
	Возврат ТаблицаЭтапы;
	
КонецФункции

#КонецОбласти

#Область ЗаписьПравилОбработки

&НаКлиенте
Процедура ЗаписатьНастройкиПравилОбработки(Закрыть = Ложь)
	ДлительнаяОперация = ЗаписатьНастройкиПравилОбработкиНаСервере();
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаписатьНастройкиПравилОбработкиЗавершение",
													 ЭтотОбъект,
													 Новый Структура("Закрыть", Закрыть));
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);	
КонецПроцедуры

&НаСервере
Функция ЗаписатьНастройкиПравилОбработкиНаСервере()
	
	ДополнительныеНастройки = Новый Структура;
	ДополнительныеНастройки.Вставить("ЗавершатьЗаявкиСотрудниковПослеПодписанияСправки", ЗавершатьЗаявкиСотрудникаПослеПодписанияСправки);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения,
												  "БизнесПроцессыЗаявокСотрудников.ЗаписатьНастройкиПравилОбработки",
												  РеквизитФормыВЗначение("НастройкиПравил"),
												  ВидНастройки,
												  ДополнительныеНастройки);	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьЭлементы(Дерево, ДеревоФормы = Ложь)
	Возврат БизнесПроцессыЗаявокСотрудниковКлиентСервер.ПолучитьЭлементы(Дерево, ДеревоФормы);	
КонецФункции

#КонецОбласти

#Область ИзменениеВариантовНастроек

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	НастройкиПоВидамЗаявки = (ВидНастройки = 0);
	Элементы.НастройкиПравилСписокПользователей.Видимость = НастройкиПоВидамЗаявки;
	Элементы.НастройкиПравилСтруктураПредприятия.Видимость = (ВидНастройки = 1);
	Элементы.НастройкиПравилСтруктураПредприятияЭтапы.Видимость = (ВидНастройки = 1);
	Элементы.НастройкиПравилЭтапы.Видимость = (ВидНастройки = 0);
	
	ИспользуетсяКадровыйЭДО = ПолучитьФункциональнуюОпцию("ИспользуетсяКадровыйЭДОКабинетСотрудника");
	Элементы.НастройкиПравилЭтапыТребуетсяПодпись.Видимость = ИспользуетсяКадровыйЭДО;
	Элементы.НастройкиПравилСтруктураПредприятияЭтапыТребуетсяПодпись.Видимость = ИспользуетсяКадровыйЭДО;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиБезСтруктуры(ТекущаяРоль = Неопределено)
	
	Если ТекущаяРоль <> Неопределено Тогда
		ЗаполнитьНастройкиБезСтруктурыДляРоли(ТекущаяРоль);	
	Иначе
		Для Каждого Настройка Из НастройкиПравил Цикл
			ЗаполнитьНастройкиБезСтруктурыДляРоли(Настройка.РольИсполнителя);	
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиБезСтруктурыДляРоли(Роль)
	
	НастройкаПравилОбработки = НастройкиПравил.НайтиСтроки(Новый Структура("РольИсполнителя", Роль))[0];
	
	НастройкаПравилОбработкиСтруктураПредприятия = НастройкаПравилОбработки.СтруктураПредприятия.ПолучитьЭлементы()[0];
	
	НастройкаПравилОбработки.СписокПользователей.ЗагрузитьЗначения(НастройкаПравилОбработкиСтруктураПредприятия.СписокПользователей.ВыгрузитьЗначения());
	НастройкаПравилОбработки.Этапы.Загрузить(НастройкаПравилОбработкиСтруктураПредприятия.Этапы.Выгрузить());

КонецПроцедуры
#КонецОбласти

#Область УсловноеОформление

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	УстановитьУсловноеОформлениеТаблицыЭтапов("НастройкиПравил.Этапы");
	УстановитьУсловноеОформлениеТаблицыЭтапов("НастройкиПравил.СтруктураПредприятия.Этапы");
	
	// Скрываем гиперссылку для заявок без правил согласования в 1С:Кабинет сотрудника.
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлементы = Элемент.Поля.Элементы.Добавить();
	ПолеЭлементы.Поле = Новый ПолеКомпоновкиДанных(Элементы.НастройкиПравилГиперссылка.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НастройкиПравил.Гиперссылка");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеТаблицыЭтапов(ПутьКДанным)
	
	// Скрываем гиперссылку для обычных этапов.
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[СтрЗаменить(ПутьКДанным, ".", "") + "Гиперссылка"].Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКДанным + ".ВнешнийСервис");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Скрываем детальную настройку для этапов внешнего сервиса.
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[СтрЗаменить(ПутьКДанным, ".", "") + "СрокЗадачи"].Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[СтрЗаменить(ПутьКДанным, ".", "") + "ТребуетсяПодпись"].Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКДанным + ".ВнешнийСервис");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОповещений

&НаКлиенте
Процедура ЗаписатьИЗакрытьНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	ЗаписатьНастройкиПравилОбработки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНастройкиПравилОбработкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Статус = "Выполнено" Тогда
		
		Модифицированность = Ложь;
		Если ДополнительныеПараметры.Закрыть Тогда
			Закрыть();
		КонецЕсли;
		
		Для Каждого НастройкаПравил Из НастройкиПравил Цикл
			ЭлементыНастроекПравил = ПолучитьЭлементы(НастройкаПравил.СтруктураПредприятия, Истина);
			Для Каждого ЭлементНастроекПравил Из ЭлементыНастроекПравил Цикл
				ЭлементНастроекПравил.Изменено = Ложь;	
			КонецЦикла;
		КонецЦикла;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		ТекстСообщения = НСтр("ru = 'При сохранении настроек правил обработки заявок сотрудников произошла ошибка:'") 
						 + Символы.ПС + Результат.КраткоеПредставлениеОшибки;
		ИнформированиеПользователяКлиент.Предупредить(ТекстСообщения, Результат.ПодробноеПредставлениеОшибки,);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПользователейВыборЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	Если ВидНастройки = 0 Тогда
		СписокПользователейСтроки = Элементы.НастройкиПравил.ТекущиеДанные.СписокПользователей;
		СписокПользователейСтроки.ЗагрузитьЗначения(Результат);
		
		ЗаполнитьИзНастроекБезСтруктуры("СписокПользователей");
	ИначеЕсли ВидНастройки = 1 Тогда
		СписокПользователейСтроки = Элементы.НастройкиПравилСтруктураПредприятия.ТекущиеДанные.СписокПользователей;
		СписокПользователейСтроки.ЗагрузитьЗначения(Результат);
		
		ЗаполнитьПодчиненныеЭлементы("СписокПользователей");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидНастройкиПриИзмененииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		ВидНастройки = 1;
		Возврат;
	КонецЕсли;
	
	ВидНастройкиПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ЗаполнитьИзНастроекБезСтруктуры(ИмяРеквизита)
	Модифицированность = Истина;
	Роль = Элементы.НастройкиПравил.ТекущиеДанные.РольИсполнителя;
	ЗаполнитьИзНастроекБезСтруктурыНаСервере(ИмяРеквизита, Роль);		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзНастроекБезСтруктурыНаСервере(ИмяРеквизита, ТекущаяРоль = Неопределено)
	Если ТекущаяРоль <> Неопределено Тогда
		ЗаполнитьИзНастроекБезСтруктурыНаСервереДляРоли(ИмяРеквизита, ТекущаяРоль);	
	Иначе
		Для каждого Настройка Из НастройкиПравил Цикл
			ЗаполнитьИзНастроекБезСтруктурыНаСервереДляРоли(ИмяРеквизита, Настройка.РольИсполнителя); 	
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьИзНастроекБезСтруктурыНаСервереДляРоли(ИмяРеквизита, Роль)
	
	НастройкиПравилДляРоли = НастройкиПравил.НайтиСтроки(Новый Структура("РольИсполнителя", Роль));
	
	ЭлементыНастроекПравил = ПолучитьЭлементы(НастройкиПравилДляРоли[0].СтруктураПредприятия, Истина);
	Для каждого ЭлементНастройкиПравил Из ЭлементыНастроекПравил Цикл
		Если ТипЗнч(ЭлементНастройкиПравил[ИмяРеквизита]) = Тип("СписокЗначений") Тогда
			ЭлементНастройкиПравил[ИмяРеквизита].ЗагрузитьЗначения(НастройкиПравилДляРоли[0][ИмяРеквизита].ВыгрузитьЗначения());
		ИначеЕсли Тип(ЭлементНастройкиПравил[ИмяРеквизита]) = Тип("ДанныеФормыКоллекция") Тогда
			ЭлементНастройкиПравил[ИмяРеквизита].Загрузить(НастройкиПравилДляРоли[0][ИмяРеквизита].Выгрузить());
		Иначе
			ЭлементНастройкиПравил[ИмяРеквизита] = НастройкиПравилДляРоли[0][ИмяРеквизита];
		КонецЕсли;
		ЭлементНастройкиПравил.Изменено = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПодчиненныеЭлементы(ИмяКолонки)
	
	ТекущиеДанные = Элементы.НастройкиПравилСтруктураПредприятия.ТекущиеДанные;
	ТекущиеДанные.Изменено = Истина;
	
	ЗаполнитьПодчиненныеЭлементыНаСервере(
		ТекущиеДанные.ПолучитьИдентификатор(),
		Элементы.НастройкиПравил.ТекущиеДанные.ПолучитьИдентификатор(),
		ИмяКолонки);
	
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьПодчиненныеЭлементыНаСервере(ИдентификаторТекущихДанных, ИдентификаторТекущейРоли, ИмяКолонки);
	
	ТекущиеДанныеРоли = НастройкиПравил.НайтиПоИдентификатору(ИдентификаторТекущейРоли);
	ТекущиеДанные = ТекущиеДанныеРоли.СтруктураПредприятия.НайтиПоИдентификатору(ИдентификаторТекущихДанных);
	
	НастройкиПодчиненныхПодразделений = ПолучитьЭлементы(ТекущиеДанные, Истина);
	Для каждого НастройкаПодразделения Из НастройкиПодчиненныхПодразделений Цикл
		Если ТипЗнч(НастройкаПодразделения[ИмяКолонки]) = Тип("СписокЗначений") Тогда
			НастройкаПодразделения[ИмяКолонки].ЗагрузитьЗначения(ТекущиеДанные[ИмяКолонки].ВыгрузитьЗначения());
		ИначеЕсли ТипЗнч(НастройкаПодразделения[ИмяКолонки]) = Тип("ДанныеФормыКоллекция") Тогда	
			НастройкаПодразделения[ИмяКолонки].Загрузить(ТекущиеДанные[ИмяКолонки].Выгрузить());	
		Иначе
			НастройкаПодразделения[ИмяКолонки] = ТекущиеДанные[ИмяКолонки];
		КонецЕсли;
		НастройкаПодразделения.Изменено = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВидНастройкиПриИзмененииНаСервере()
	
	УстановитьВидимостьЭлементов();
	
	Если ВидНастройки = 1 Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьНастройкиБезСтруктуры();
	
	Модифицированность = Истина;
	ЗаполнитьИзНастроекБезСтруктурыНаСервере("СписокПользователей");
	ЗаполнитьИзНастроекБезСтруктурыНаСервере("Этапы");

КонецПроцедуры

&НаСервере
Функция ПараметрыОткрытияОтчета()
	
	ОтчетОбъект = Отчеты.Задачи.Создать();
	КомпоновщикНастроек = ОтчетОбъект.КомпоновщикНастроек;
	
	ЭлементОтбора =  КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ЭлементОтбора.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор();
	ЭлементОтбора.Представление = НСтр("ru = 'Заявки сотрудников'");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("БизнесПроцесс.ТипЗаявкиКабинетСотрудника");
	ЭлементОтбора.ПравоеЗначение = Перечисления.ТипыЗаявокКабинетСотрудника.ПустаяСсылка();
	ЭлементОтбора.Использование = Истина;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыФормы.Вставить("Вариант", КомпоновщикНастроек.Настройки);
	ПараметрыФормы.Вставить("КлючВарианта", "ЗаявкиСотрудника");
	ПараметрыФормы.Вставить("ПользовательскиеНастройки", КомпоновщикНастроек.ПользовательскиеНастройки);
	
	Возврат ПараметрыФормы;
	
КонецФункции

&НаСервере
Функция ВидНастройки()

	ПустыеПодразделения = БизнесПроцессыЗаявокСотрудников.ПараметрЗапросаПустыеПодразделения();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПустыеПодразделения", ПустыеПодразделения);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПравилаОбработкиЗаявокСотрудников.СрокЗадачи КАК СрокЗадачи
	|ИЗ
	|	РегистрСведений.ПравилаОбработкиЗаявокСотрудников КАК ПравилаОбработкиЗаявокСотрудников
	|ГДЕ
	|	НЕ ПравилаОбработкиЗаявокСотрудников.Подразделение В (&ПустыеПодразделения)";
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ?(РезультатЗапроса.Пустой(), 0, 1);

КонецФункции

&НаСервере
Функция ПроверитьСтруктуруПредприятия()

	Запрос = Новый Запрос;
	Если ПубликоватьСтруктуруЮридическихЛиц Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Организации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	НЕ Организации.ПометкаУдаления
		|	И НЕ Организации.Предопределенный
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПодразделенияОрганизаций.Ссылка
		|ИЗ
		|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций";
	Иначе
		СтруктураПредприятия = Новый(БизнесПроцессыЗаявокСотрудниковВнутренний.ТипСтруктураПредприятия());
		ИмяТаблицы = СтруктураПредприятия.Метаданные().ПолноеИмя();
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Таблица.Ссылка КАК Ссылка
		|ИЗ
		|	#Таблица КАК Таблица";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Таблица", ИмяТаблицы);
	КонецЕсли;
	
	Попытка
		РезультатЗапроса = Запрос.Выполнить();
		РезультатПроверки = Новый Структура;
		РезультатПроверки.Вставить("Доступна", Истина);
		РезультатПроверки.Вставить("Пустая", РезультатЗапроса.Выбрать().Количество() = 0);
		Возврат РезультатПроверки;
	Исключение
		// Отсутствует полный доступ к структуре предприятия.
		РезультатПроверки = Новый Структура;
		РезультатПроверки.Вставить("Доступна", Ложь);
		РезультатПроверки.Вставить("Пустая", Истина);
		Возврат РезультатПроверки;
	КонецПопытки;

КонецФункции

&НаСервереБезКонтекста
Функция ПараметрыОткрытияПравилаСогласования(Этап, Подразделение = Неопределено)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Ключ", Справочники.ПравилаСогласованияЗаявокКабинетСотрудника.ПустаяСсылка());
	ПараметрыОткрытия.Вставить("ТипЗаявки", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Этап, "ТипЗаявки"));
	Если Подразделение <> Неопределено Тогда
		ПараметрыОткрытия.Вставить("Подразделение", Подразделение);
	КонецЕсли;
	
	ПустыеПодразделения = БизнесПроцессыЗаявокСотрудников.ПараметрЗапросаПустыеПодразделения();
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПравилаСогласования.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ПравилаСогласованияЗаявокКабинетСотрудника КАК ПравилаСогласования
	               |ГДЕ
	               |	ПравилаСогласования.Подразделение В (&Подразделения)
	               |	И ПравилаСогласования.ТипЗаявки = &ТипЗаявки";
	
	Запрос.УстановитьПараметр("ТипЗаявки", ПараметрыОткрытия.ТипЗаявки);
	Запрос.УстановитьПараметр("Подразделения",
		?(Подразделение = Неопределено,
			ПустыеПодразделения,
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Подразделение)));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
			ПараметрыОткрытия.Ключ = Выборка.Ссылка;
	ИначеЕсли Подразделение <> Неопределено Тогда
		Если ТипЗнч(Подразделение) = Тип("СправочникСсылка.Организации") Тогда
			Возврат ПараметрыОткрытияПравилаСогласования(Этап);
		ИначеЕсли ТипЗнч(Подразделение) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
			РеквизитыПодразделения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Подразделение, "Родитель, Владелец");
			Если ЗначениеЗаполнено(РеквизитыПодразделения.Родитель) Тогда
				Возврат ПараметрыОткрытияПравилаСогласования(Этап, РеквизитыПодразделения.Родитель);	
			Иначе
				Возврат ПараметрыОткрытияПравилаСогласования(Этап, РеквизитыПодразделения.Владелец);
			КонецЕсли;
		Иначе
			Родитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Подразделение, "Родитель");
			Возврат ПараметрыОткрытияПравилаСогласования(Этап, Родитель);
		КонецЕсли;
	КонецЕсли;
		
	Возврат ПараметрыОткрытия;
	
КонецФункции

&НаСервереБезКонтекста
Функция ВидЗаявкиСЭтапамиВнешнегоСервиса(Роль)
	
	ТаблицаРолей = Новый ТаблицаЗначений;
	ТаблицаРолей.Колонки.Добавить("Роль");
	ТаблицаРолей.Колонки.Добавить("ВидЗаявки");
	
	НастраиваемыеВидыЗаявокВнешнегоСервиса = Справочники.ПравилаСогласованияЗаявокКабинетСотрудника.ДоступныеТипыЗаявок();
	Для Каждого ВидЗаявки Из НастраиваемыеВидыЗаявокВнешнегоСервиса Цикл
				
		ИмяТаблицы = БизнесПроцессыЗаявокСотрудников.СоответствиеЗаявкиИТипаЗаявки()[ВидЗаявки];
		РольИсполнителя = БизнесПроцессыЗаявокСотрудников.РолиИсполнителейЗаявокПоТипамЗапросов()[ИмяТаблицы];
		
		СтрокаРоли = ТаблицаРолей.Добавить();
		СтрокаРоли.Роль = РольИсполнителя;
		СтрокаРоли.ВидЗаявки = ВидЗаявки;
		
	КонецЦикла;
	
	СтрокаРоли = ТаблицаРолей.Найти(Роль, "Роль");
	Если СтрокаРоли = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат СтрокаРоли.ВидЗаявки;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗаблокированоНаВремяОбновления() 
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПравилаОбработкиЗаявокСотрудников.РольИсполнителя КАК РольИсполнителя,
	               |	ПравилаОбработкиЗаявокСотрудников.Подразделение КАК Подразделение,
	               |	ПравилаОбработкиЗаявокСотрудников.СрокЗадачи КАК СрокЗадачи
	               |ИЗ
	               |	РегистрСведений.ПравилаОбработкиЗаявокСотрудников КАК ПравилаОбработкиЗаявокСотрудников
	               |ГДЕ
	               |	ПравилаОбработкиЗаявокСотрудников.Этап = ЗНАЧЕНИЕ(Справочник.ЭтапыЗаявокСотрудников.ПустаяСсылка)
	               |ИТОГИ ПО
	               |	РольИсполнителя";
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти
